# Напишите программу, которая принимает на вход координаты точки (X и Y), причём X ≠ 0 и Y ≠ 0 и выдаёт н
# омер четверти плоскости,
# в которой находится эта точка (или на какой оси она находится).
# Пример:
# - x=34; y=-30 -> 4
# - x=2; y=4-> 1
# - x=-34; y=-30 -> 3

X = int(input('Введите X '))
Y = int(input('Введите Y '))
if X == 0 or Y == 0:
    print('X и Y не должны равнятся 0!')
if X > 0 and Y > 0:
    print('Точка находится в 1 четверти.')
if X < 0 and Y > 0:
    print('Точка находится во 2 четверти.')
if X < 0 and Y < 0:
    print('Точка находится в 3 четверти.')
if X > 0 and Y < 0:
    print('Точка находится в 4 четверти.')